A = 4 ** 36 - 3 * (4 ** 20) + 4 ** 15 + 2 * (4 ** 7) + 49
B = hex(A)
print(B)
#Сколько различных цифр в записи 4 ** 36 - 3 * (4 ** 20) + 4 ** 15 + 2 * (4 ** 7) + 49 в 16-и ричной системе
#ответ 5